# Напишите программу, которая принимает на вход 
# координаты двух точек и находит расстояние между 
# ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

#d = √ [(x2-x1)*(x2-x1)+ (y2-y1)*(y2-y1)]

import os
clear = lambda: os.system('cls')
clear()

x1 = int(input("Введите x для a: "))
y1 = int(input("Введите y для a: "))
x2 = int(input("Введите x для b: "))
y2 = int(input("Введите y для b: "))

s = ((x2-x1)*(x2-x1) + (y2-y1)*(y2-y1))**0.5
print(round(s, 2))
